{
    "day1-commons": {
        "description": "The first day you come into the school and there is a gathering in the Commons for the incoming freshmen. Where will you sit?",
        "choices": [
            {
                "id": "sit-center",
                "text": "Sit in the center with the rest of the group",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-center"
            },
            {
                "id": "sit-couch",
                "text": "Sit on the couches with some other students",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-couch-intro"
            },
            {
                "id": "sit-outskirts",
                "text": "Sit on the outskirts where nobody else is sitting",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day1-commons-outskirts-intro"
            }
        ]
    },
    "day1-commons-center": {
        "description": "After sitting with all of the students, one of the students named Michael starts talking to you. He seems really cool and has some of the same hobbies as you. A girl named Rachel sitting by you guys chimes in when she hears you mention your small hometown which she also happens to be from. How do you respond to this?",
        "choices": [
            {
                "id": "ignore-rachel",
                "text": "Ignore Rachel and continue talking with Michael",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day1-commons-center-response1"
            },
            {
                "id": "joke-rachel",
                "text": "Crack a joke to include Rachel",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-center-response2"
            },
            {
                "id": "recognize-rachel",
                "text": "Tell Rachel you thought she looked familiar",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-center-response3"
            }
        ]
    },
    "day1-commons-center-response1": {
        "description": "Michael feeling the awkward tension with Rachel being ignored says how we live in a small world for both of you guys to be from the same place. This leads to Rachel joining your guy's conversation.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-a"
            }
        ]
    },
    "day1-commons-center-response2": {
        "description": "The joke being a dumb inside joke from your local high school,thankfully Rachel finds the joke funny. Michael asks to be let into the joke as he doesn’t understand and you and Rachel both explain it to him.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-a"
            }
        ]
    },
    "day1-commons-center-response3": {
        "description": "and Rachel comments the same to you and how it isn't too surprising as there was one high school that housed all the students in your hometown.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-a"
            }
        ]
    },
    "day1-commons-couch-intro": {
        "description": "While heading to the couches you find a decently comfortable looking spot next to 2 other students who are just scrolling on their phones. You take a seat and wait awkwardly while the event gets started. Once the event gets rolling they put their phones away, you take this opportunity to introduce yourself. You get to know them pretty well, there is Sarah who definitely has more of a punk vibe to her, she talks a lot about her interest in the band The Clash and old Green Day. Then there is Jerome who is already a part of the Super Smash Bros. Ultimate Esports team. Apart from that he seems to be more of a quiet fellow. You continue chatting for the entire event and it’s finally time for your first class.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-couch"
            }
        ]
    },
    "day1-commons-couch": {
        "description": "You walk into the room for your intro to CS class, you don’t see anyone you know, where will you sit?",
        "choices": [
            {
                "id": "front-row",
                "text": "You decide to sit in the front row closest to the professor.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-couch-response"
            },
            {
                "id": "back-row",
                "text": "You decide to take a seat in the empty back row.",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day1-commons-couch-response"
            },
            {
                "id": "center-row",
                "text": " You decide to take a seat in the center where most of the other students are.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-couch-response"
            }
        ]
    },
    "day1-commons-couch-response": {
        "description": "You take your seat and listen to the professor, the class goes by quickly and at the end the class gets assigned some homework, to get to know the other freshmen. The assignment is pretty simple, you have to ask 10 new students some general questions then have them sign off on your page. You have your OOP class next which goes smoothly with both Sarah and Jerome in the class, it was really just a syllabus day.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-b"
            }
        ]
    },
    "day1-commons-outskirts-intro": {
        "description": "You head to the tall chairs by the ping pong table which also happens to be the most deserted part of the commons. You take a seat and pull out your phone, you put in your earbuds and start up your favorite songs. Although you are keeping to yourself the event gets started and you start looking around, you notice a few groups that stand out. You first see what could be an awkward couple with a girl with punk-rock headphones sitting on the couches by a quiet guy who looks glued to his phone. You notice another pair of students laughing loudly in the center of the commons. They seem way more sociable then you and seem to be having a blast. Eventually the gathering ends and it's time for your first class.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-outskirts"
            }
        ]
    },
    "day1-commons-outskirts": {
        "description": "You walk into the Intro to CS classroom, not seeing anyone you know. Where will you sit?",
        "choices": [
            {
                "id": "window",
                "text": "You decide to sit by the window furthest from the professor.",
                "effects": { "gpa": -0.5, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-outskirts-response"
            },
            {
                "id": "front-row",
                "text": "You decide to sit in the front row closest to the professor.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-outskirts-response"
            },
            {
                "id": "back-row",
                "text": "You decide to take a seat in the empty back row",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-commons-outskirts-response"
            }
        ]
    },
    "day1-commons-outskirts-response": {
        "description": "You take your seat and listen to the professor, the class goes by quickly. At the end, the professor assigns some pretty simple homework, to get to know the other freshmen. The assignment is pretty simple, you have to ask 10 new students some general questions then have them sign off on your page.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-c"
            }
        ]
    },
    "day1-lunch-a": {
        "description": "After wrapping up the event everyone heads to class, somehow you are the first person in to class and you get a seat up in the front of the class, thankfully some familiar faces walk in when Rachel then Michael come into the class both sitting next to you. After chatting a little bit, you guys find out that I have the same schedule. Class goes by smoothly and at the end you're giving a home assignment to get to know some of the other freshmen. You have to ask some general questions to ten different students and have them sign off on your paper. During lunch you, Michael and Rachel decide to try and finish up the home assignment, but who will you ask for the assignment.",
        "choices": [
            {
                "id": "ask-michael-and-rachel",
                "text": "Ask Michael and Rachel then just hang along with them and ask the same people they do.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-a-response1"
            },
            {
                "id": "ask-different-people",
                "text": "Say that you guys should ask different people instead of just having the same assignment that you all turn in.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-a-response2"
            },
            {
                "id": "wait-for-others",
                "text": "Ask Michael and Rachel and wait until people ask you then you ask them back.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-a-response3"
            }      
        ]
    },
    "day1-lunch-a-response1": {
        "description": "They say that’s a great idea, so you guys go around asking people you see in the commons and halls. Ultimately you finish up pretty quickie and sit down to have lunch with Michael and Rachel. While finishing the homework you guys meet a super interesting guy named Josh who is basically a prodigy and is super smart with computers. He joins you in lunch and you guys chat about school and life overall.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0.2, "sanity": 0, "burnout": 0 },
                "next": "day2-morning-a"
            }
        ]
    },
    "day1-lunch-a-response2": {
        "description": "They agree and you each go on your own to finish this project, the final person you ask is Josh a prodigy programmer who loves working with computers, you guys kick it off and chat for the remainder of lunch.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 5, "burnout": 0 },
                "next": "day2-morning-a"
            }
        ]
    },
    "day1-lunch-a-response3": {
        "description": "After asking Michael and Rachel you sit down and wait, during this time 3 people ask you and you only get to ask one of them to help with your own. Towards the end of lunch Rachel and Michael meet up with you and introduce you to a programming prodigy named Josh they meet while doing the homework. This ultimately leads to you turning in the assignment late.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": -0.2, "sanity": 0, "burnout": 0 },
                "next": "day2-morning-a"
            }
        ]
    },
    "day1-lunch-b": {
        "description": "Lunch comes around and Jerome and Sarah invite you to go eat at the mall with them.",
        "choices": [
            {
                "id": "mall",
                "text": "You accept their invite and head to the mall.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-b-response1"
            },
            {
                "id": "next-time",
                "text": "You say that you have an assignment to do but next time for sure.",
                "effects": { "gpa": 0.2, "sanity": -2, "burnout": 2 },
                "next": "day1-lunch-b-response2"
            },
            {
                "id": "wait-for-me",
                "text": "You ask them to wait until you complete your assignment real quick first.",
                "effects": { "gpa": 0.2, "sanity": 0, "burnout": 0 },
                "next": "day1-lunch-b-response3"
            }      
        ]
    },
    "day1-lunch-b-response1": {
        "description": "On the way to the mall you guys chat about your lives back home. You get to the food court and decide to eat at Chick-Fil-A because Jerome has never tried it before. You decide to sit at the food court and chat away the remainder of lunch.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-morning-b"
            }
        ]
    },
    "day1-lunch-b-response2": {
        "description": "They both seem bummed but say it’s all good and that next time you won’t get away so easily. You walk around the commons and ask everyone you see also doing the assignment. This doesn’t take all that long so you sit in the commons looking over emails about your other classes and do some research into potential future classes for the rest of lunch.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-morning-b"
            }
        ]
    },
    "day1-lunch-b-response3": {
        "description": "They say that’s not a problem and ask what the homework is and if they can help at all. They are the first two people you ask and they help you ask a few more. After about 20 minutes of looking for other freshmen you guys head to the mall. You chat about future plans and goals. You guys grab some McDonalds and head back to the school. You guys end up chilling on the couches until lunch is over.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-morning-b"
            }
        ]
    },
    "day1-lunch-c": {
        "description": "Lunch comes around, and you quickly pack up, eager to avoid the crowds. What will you do for lunch?",
        "choices": [
            {
                "id": "do-assignment",
                "text": "Immediately start looking for students doing the assignment in quiet areas.",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 2 },
                "next": "day1-lunch-c-response1"
            },
            {
                "id": "study",
                "text": "Head directly to a study room to research potential answers for the assignment's \"general questions\" to be prepared.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 2 },
                "next": "day1-lunch-c-response2"
            },
            {
                "id": "go-home",
                "text": "Go back to your dorm to grab a snack and mentally prepare for the daunting task of talking to strangers later.",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day1-lunch-c-response3"
            }      
        ]
    },
    "day1-lunch-c-response1": {
        "description": "You scan the Commons, spotting a few other lone figures with papers in hand. You approach them and exchange questions and signatures. This doesn't take long, and you manage to finish your assignment before the lunch rush truly hits, giving you time to review some notes on your laptop.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-morning-c"
            }
        ]
    },
    "day1-lunch-c-response2": {
        "description": "You make your way to a study room finding a quiet one. You spend a good portion of lunch researching common \"get to know you\" questions and, more importantly, looking up interesting facts about your major to use as conversation starters. This preparation makes you feel ready, but you're still without any signatures.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-morning-c"
            }
        ]
    },
    "day1-lunch-c-response3": {
        "description": "You retreat to your dorm, grabbing a quick snack and mentally psyching yourself up for the assignment. The thought of approaching ten strangers is draining. You spend the rest of lunch playing a quick game on your laptop, hoping to clear your head before tackling the homework after classes.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": -0.3, "sanity": 0, "burnout": 0 },
                "next": "day2-morning-c"
            }
        ]
    },
    "day2-morning-a": {
        "description": "You wake up with the sun shining through your room's curtains. Today is the first day of actual foundational classes referring to computer science or just computers in general. You notice your roommate Jerome is already out of the room and you meet him in the kitchen eating breakfast fast. You join them after making a quick bowl of cereal. After eating you both head to class.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 3, "burnout": 0 },
                "next": "day2-class-a"
            }
        ]
    },
        "day2-morning-b": {
        "description": "You wake up to the sound of your roommate up and about. You get out of your PJs and get changed and walk out to the kitchen area. To your surprise you see Jerome there apparently he was your roommate and you didn’t notice until just now. You guys sit down and eat together and head out to school together. You get to school and head to your first class for the day which is OOP. Today the main focus is on a week long project, the professor recommends that you get into groups of 3-4. At the end of class you Sarah and Jerome decide to work on the project together.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 2 },
                "next": "day2-lunch-b"
            }
        ]
    },
    "day2-morning-c": {
        "description": "You wake up to some buzzing in the kitchen, you head in and see your roommate Jerome making some food. You quickly make yourself some cereal and quietly eat it on the kitchen counter. After this you wash your bowl and spoon then head to school.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -3, "burnout": 0 },
                "next": "day2-class-c"
            }
        ]
    },
    "day2-class-a": {
        "description": "Your first class is an OOP class where you find Michael, Rachel, and Josh, you go over and sit with them. The professor begins the lecture and it goes by smoothly. After the lecture, the professor announces your first major assignment: a team-based project that will be due on Friday. He says that the project will be the main thing you'll be working on for the rest of the week, and he encourages you to find a team of four by the end of the day. You guys decide to join a group together. But what will you guys work on?",
        "choices": [
            {
                "id": "calculator",
                "text": "You decide to make a calculator.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-class-a-response1"
            },
            {
                "id": "game",
                "text": "You decide to make a simple game.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-class-a-response2"
            },
            {
                "id": "chatbot",
                "text": "You decide to make an AI chatbot.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-class-a-response3"
            }      
        ]
    },
    "day2-class-a-response1": {
        "description": "This should be pretty easy Josh says, we should probably focus a lot on design to make it stand out, he adds. You all agree and decide to make a stylish calculator.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-gathering-decision-a"
            }
        ]
    },
    "day2-class-a-response2": {
        "description": "Michel really likes this idea and comments that a text base rouge like game would be an easy one. This seems like the best option for the group and you decide to do that.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-gathering-decision-a"
            }
        ]
    },
    "day2-class-a-response3": {
        "description": "Rachel comments that she’s done web tutorials on chatbots and that she feels they won’t follow OPP super well, so ultimately you decide to make a notes app to jot down notes during class using your own customized notes app.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-gathering-decision-a"
            }
        ]
    },
    "day2-gathering-decision-a": {
        "description": "The rest of the day goes by smoothly with nothing super interesting happening. After your final class you guys meet up with Josh. He’s talking with a second year student about a gathering that some students are having at 7:00pm. The second year named Cody invites you guys to the gathering. Everyone says that sounds really fun and would love to go, they look at you waiting to see what you think.",
        "choices": [
            {
                "id": "accept",
                "text": "Accept the invite",
                "effects": { "gpa": 0, "sanity": 3, "burnout": -3 },
                "next": "day2-party-a"
            },
            {
                "id": "decline",
                "text": "Decline the invite",
                "effects": { "gpa": 0, "sanity": -3, "burnout": 0 },
                "next": "day2-no-party-a"
            }
        ]
    },
    "day2-party-a": {
        "description": "After your run in with Cody you all go home and you begin to get ready. You start getting ready for the party around 5pm and head over to the address you were given getting there at 7:30. To your surprise it seems pretty calm and quiet. You knock hoping you got the right address, after anxiously waiting for a response for what seemed like an eternity,  Cody finally opens the door. He welcomes you into the house saying that everyone should be dropping by within the next 20ish minutes. By 8:00 there is a decent gathering of about 40 people with a bunch of activities ranging from board games and video games to an area with arts and crafts like paint and balloon animals, in the kitchen/dining area there are just people chatting. After meeting up with your group and chatting in the dining area,  you guys talk about what you should do next.",
        "choices": [
            {
                "id": "card-games",
                "text": "You say that some card games would be fun to pass the time.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": -2 },
                "next": "day2-party-a-card-games"
            },
            {
                "id": "art",
                "text": "You say that the arts area looks interesting and head over there.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": -2 },
                "next": "day2-party-a-art"
            }
        ]
    },
    "day2-party-a-card-games": {
        "description": "You say that some card games would be fun to pass the time. You join a game of poker with Cody and a few other students. You win a few rounds and lose a few, but you learn how to read other people's body language and their tells. By the end of the night, you have a solid understanding of how to read people and what to look for when you're in a conversation with them.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-chatting-a"
            }
        ]
    },
    "day2-party-a-art": {
        "description": "You say that the arts area looks interesting and head over there. While painting, you get into a conversation with a graphic design major named Lily. She's impressed by your creative ideas and tells you about a project she's working on that could use a programmer. You exchange contact information and spend the rest of the night talking about potential collaborations. You head home and get some much needed sleep.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-morning-a"
            }
        ]
    },
    "day2-chatting-a": {
        "description": "You say that you wouldn’t mind chatting some more and that none of the activities seem all that interesting. You and your friends spend the rest of the night talking about school, life, and your futures. You all feel closer as friends, and you now have a solid support group on campus.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-morning-a"
            }
        ]
    },
    "day2-no-party-a": {
        "description": "You decide to decline Cody's invite and head straight home. Because the workload for today was super light, you have plenty of free time to kill. You decide to open your laptop, but are stuck between playing video games and working on a personal project. Despite declining the invite, you can't help but feel a little curious about how the party is going. How would you go about spending your evening?",
        "choices": [
            {
                "id": "work",
                "text": "Work On Your Personal Project",
                "effects": { "gpa": 0.1, "sanity": -2, "burnout": 4 },
                "next": "day2-no-party-a-work"
            },
            {
                "id": "games",
                "text": "Play Video Games",
                "effects": { "gpa": -0.2, "sanity": 2, "burnout": -3 },
                "next": "day2-no-party-a-game"
            },
            {
                "id": "gym",
                "text": "Go To The Gym",
                "effects": { "gpa": 0, "sanity": 2, "burnout": -2 },
                "next": "day2-no-party-a-gym"
            }
        ]
    },
    "day2-no-party-a-work": {
        "description": "You decide to spend the evening working on your personal project. You encounter a few hindrances here and there, but you manage to work around them with the help of documentation and StackOverflow. You feel kind of bad for missing out on the party Cody is hosting, but at least you are improving your programming skills. You manage to complete writing a few classes and functions, but the realization it’s midnight hits you. Do you go to sleep or do you continue working on your personal project?",
        "choices": [
            {
                "id": "sleep",
                "text": "Go To Sleep",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-morning-a"
            },
            {
                "id": "work",
                "text": "Continue Working On Personal Project",
                "effects": { "gpa": 0.1, "sanity": -3, "burnout": 3 },
                "next": "day2-no-party-a-work-continue"
            }
        ]
    },
    "day2-no-party-a-work-continue": {
        "description": "You continue working on your personal project, but as the night wears on, you start to feel the effects of fatigue setting in. Your focus wanes, and you find yourself making more mistakes than usual. You realize that pushing yourself too hard is counterproductive, and that getting a good night's sleep is essential for maintaining your mental clarity and overall well-being. Eventually, you decide to call it a night and head to bed, hoping to get a good night's sleep to recharge for the next day.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-morning-a"
            }
        ]
    },
    "day2-no-party-a-game": {
        "description": "You decide to unwind and spend the evening playing a few rounds of the current video game you’re currently maining. Your overall performance in the rounds was relatively balanced; you didn’t play badly, but you also didn’t play that good either. You managed to win a game, lose the next game, and then get a draw for the third game. You look at the clock and notice that you should probably get some sleep. What do you do?",
        "choices": [
            {
                "id": "sleep",
                "text": "Go To Sleep",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-morning-a"
            },
            {
                "id": "game",
                "text": "Continue Gaming",
                "effects": { "gpa": -0.1, "sanity": 2, "burnout": 0 },
                "next": "day2-no-party-a-game-continue"
            }
        ]
    },
    "day2-no-party-a-game-continue": {
        "description": "You continue playing video games, but after a few more rounds, you start to feel the effects of fatigue setting in. Your reactions slow down, and your performance starts to dip. You realize that staying up late playing games is taking a toll on your mental clarity and overall well-being. Eventually, you decide to call it a night and head to bed, hoping to get a good night's sleep to recharge for the next day.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-morning-a"
            }
        ]
    },
    "day2-no-party-a-gym": {
        "description": "You decide to get some exercise in and head to the community gym near the dormitory you’re staying at. The gym is more packed than usual, as it was a slow day after all. You perform a well-balanced workout routine, which involves: lifting weights, running on the treadmill, and finishing with a good chunk of laps in the gym’s swimming pool. You finish your workout session that lasts a few hours, but you’re worn and want to quickly hurry home and catch some sleep.",
        "choices": [
            {
                "id": "sleep",
                "text": "Go To Sleep",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-morning-a"
            }
        ]
    },
    "day2-lunch-b": {
        "description": "During lunch Jerome brings up a party being hosted at another esports member named Cody. You guys decide to make that plan for the night. He lets you guys know that it is at 7:30pm. The rest of the day goes smoothly and you head home with Jerome and get ready for the party.  You guys meet at the party at the planned time and head inside. There are a bunch of people and activities to partake in. They ask you what sounds good.",
        "choices": [
            {
                "id": "video-games",
                "text": "You go and play some video games",
                "effects": { "gpa": 0, "sanity": 2, "burnout": 0 },
                "next": "day2-lunch-b-response1"
            },
            {
                "id": "card-games",
                "text": "You go and play some card games.",
                "effects": { "gpa": 0, "sanity": 2, "burnout": 0 },
                "next": "day2-lunch-b-response2"
            },
            {
                "id": "chat",
                "text": "You go and chat in the kitchen area.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-lunch-b-response3"
            } 
        ]
    },
    "day2-lunch-b-response1": {
        "description": "You sit down at the coaches and play a mix of Smash Bros and Mario Party with Jerome Sarah and the other people at the party. As expected Jerome destroys everyone in Smash but it was still a really fun time. Plus Mario Party was a good finish for the games.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-class-c"
            }
        ]
    },
    "day2-lunch-b-response2": {
        "description": "While walking over to the area for the card games you see a group of students playing cards against humanity and the three of you guys decide to play. This goes on for a few hours and you all really enjoy yourselves. A student named Rachel ends up winning and claims the title as the funniest.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-class-c"
            }
        ]
    },
    "day2-lunch-b-response3": {
        "description": "You and your buddies spend the rest of the night talking about school, life, and your futures. You find out a lot about them and find out they actually know each other from some online games way back.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-class-c"
            }
        ]
    },
    "day2-class-c": {
        "description": "You get to your first class of the day which is OOP. The professor announced the first “major” project, this is a simple project that will be used to get your foot in the door and see where everyone is at. He mentions that teams are encouraged but not necessarily recommended. You sit there unsure of what to do.",
        "choices": [
            {
                "id": "ask-professor",
                "text": " Approach the professor to inquire about working solo or if he knows of any other stragglers.",
                "effects": { "gpa": 0.2, "sanity": 0, "burnout": 0 },
                "next": "day2-class-c-response1"
            },
            {
                "id": "procrastinate",
                "text": "Try and find a group last minute from the people still lingering.",
                "effects": { "gpa": -0.5, "sanity": 0, "burnout": 0 },
                "next": "day2-class-c-response2"
            },
            {
                "id": "solo",
                "text": "You decide to take this project on your own.",
                "effects": { "gpa": 0, "sanity": -4, "burnout": 4 },
                "next": "day2-class-c-response3"
            }      
        ]
    },
    "day2-class-c-response1": {
        "description": "You wait until most students have left, then approach the professor. He acknowledges that it can definitely be rough and mentions that if there are any that reach out he will get that worked out, but recommends you get started on it solo.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-lunch-c"
            }
        ]
    },
    "day2-class-c-response2": {
        "description": "You try to catch the eye of a few remaining students, but they either already have groups or politely decline. You even spot Jerome with the girl in headphones from the day one assembly in a small group looking quite focused. Feeling a bit deflated you realize you're definitely on your own for this one.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day2-lunch-c"
            }
        ]
    },
    "day2-class-c-response3": {
        "description": "You feel confident in your skill to handle this one alone even if the workload will be heavier. You mentally start outlining project ideas, ready to present your intentions to the professor when the time comes.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -2, "burnout": 3 },
                "next": "day2-lunch-c"
            }
        ]
    },
    "day2-lunch-c": {
        "description": "After class it’s lunch time and you're walking around the commons, you overhear a second year student mention a party happening tonight. You notice he’s letting the loud first years from the day one assembly know. While you question going for a bit the idea of all that burnoutizing sounds draining. You spend the rest of lunch working on your project before heading home for the day.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0.2, "sanity": -3, "burnout": 0 },
                "next": "day3-morning-c"
            }
        ]
    },
    "day3-morning-a": {
        "description": "You wake up and it’s another sunny day, the party still has you feeling highly energized and you decide to walk to school. When you get to school you meet up with your group and chat about the party last night. Everyone seems to have really enjoyed it and agrees they would love to go to another party later on. You guys get to class and everything goes smoothly. When lunch comes around you all decide to head to the mall to grab some food.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-food_court-a"
            }
        ]
    },
    "day3-food_court-a": {
        "description": "You get to the food court and realize you don’t have money but thankfully you're a McBillionaire on the McDonald’s app and get yourself a hot n spicy for free 99. After an hour at the food court talking with Michael, Rachel, and Josh mostly about classes and plans for the future. After lunch it’s time for your intro to computer science. You walk in with everyone and your professor lets everyone know there will be a simple 10 question quiz. This quiz is mainly for assessing where everyone is starting from and will not impact your grade, he says. You get going and the quiz is super easy but one question really stumps you. \"What is an algorithm?\"",
        "choices": [
            {
                "id": "incorrect-1",
                "text": "A computer program written in a specific language.",
                "effects": { "gpa": -0.1, "sanity": -2, "burnout": 0 },
                "next": "day3-morning-a-incorrect"
            },
            {
                "id": "incorrect-2",
                "text": "A type of programming language.",
                "effects": { "gpa": -0.1, "sanity": -2, "burnout": 0 },
                "next": "day3-morning-a-incorrect"
            },
                        {
                "id": "correct",
                "text": "A step-by-step procedure for solving a problem.",
                "effects": { "gpa": 0.1, "sanity": 0, "burnout": 0 },
                "next": "day3-morning-a-correct"
            }
        ]
    },
    "day3-morning-a-incorrect": {
        "description": "You are the last to finish the test and look at your screen with 6/10 looking at you. You're a bit bummed but that’s whatever because now you know what you have to learn. After class if over you decide to head home and do a bit of studying before getting to sleep.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0.1, "sanity": 0, "burnout": 0 },
                "next": "day4-morning-a"
            }
        ]
    },
    "day3-morning-a-correct": {
        "description": "You have a huge sense of relief as you were sure you got at least one wrong, but that 100% on the screen definitely feels good. Well you ask your friend how they did and it seems like only josh got 100% to no one's surprise, Rachel got 9/10 and Michael got 6/10 and they are pretty bummed they didn’t get 100% as well. After that the class continues as expected and you eventually head home to get some sleep.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 2, "burnout": 0 },
                "next": "day4-morning-a"
            }
        ]
    },
    "day3-morning-b": {
        "description": "You wake up and it’s another sunny day, the party still has you feeling highly energized and you decide to walk to school with Jerome. When you get to school you meet up with Sarah and chat about the party last night. Everyone seems to have really enjoyed it and agrees they would love to go to another party later on. You guys get to class and everything goes smoothly. When lunch comes around you all decide to head to the mall to grab some food. You are unsure what to eat.",
        "choices": [
            {
                "id": "mcdonalds",
                "text": "You decide to go for the cheap option and head to McDonalds.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-after-food-b"
            },
            {
                "id": "subway",
                "text": "You decide to go with a favorite and grab some subway.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-after-food-b"
            },
            {
                "id": "cheescake-factory",
                "text": "You feel like something fancy I stop at cheesecake factory.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-after-food-b"
            }
        ]
    },
    "day3-after-food-b": {
        "description": "You get into line and wait for the food, thankfully there isn’t much of a line yet so the food is pretty quick. You grab your food and head to Chick-fil-A to meet up with Jerome and Sarah. You guys head back to the school to finish your lunch. You guys sit in the corner by the pool table and eat your food while watching the other students play pool. When you finish up you guys look around for something to do.",
        "choices": [
            {
                "id": "pool",
                "text": "You say that you guys should join in the games of pool.",
                "effects": { "gpa": -0.1, "sanity": 0, "burnout": -3 },
                "next": "day3-after-food-b-response1"
            },
            {
                "id": "ping-pong",
                "text": "You say that you want to play ping pong.",
                "effects": { "gpa": -0.1, "sanity": 0, "burnout": -3 },
                "next": "day3-after-food-b-response2"
            },
            {
                "id": "homework",
                "text": "You mention that you should probably work the project for OOP.",
                "effects": { "gpa": 0.2, "sanity": -7, "burnout": 4 },
                "next": "day3-after-food-b-response3"
            }
        ]
    },
    "day3-after-food-b-response1": {
        "description": "You guys walk up and place your names on the que. You’ve never played before so you have a pretty rough start. After a few games you start to get the rhythm a bit but you're still no pro.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day3-after-lunch-b"
            }
        ]
    },
    "day3-after-food-b-response2": {
        "description": "You walk up to the ping pong table which is empty. You ask Sarah and Jerome who want to go first. Unknown to you Sarah is stupidly good at ping pong. She volunteers and absolutely smokes you. You all end up playing for a bit, mostly rallies after Sarah's show.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day3-after-lunch-b"
            }
        ]
    },
    "day3-after-food-b-response3": {
        "description": "You all take out your laptops and get started on your project. You guys are working in Java which you’ve never used before, luckily both Sarah and Jerome have some experience with it and help you get started. You guys make pretty substantial progress in the few hours you have available.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -7, "burnout": 2 },
                "next": "day3-after-lunch-b"
            }
        ]
    },
    "day3-after-lunch-b": {
        "description": "By now lunch is wrapping up and you all head to your last class of the day, your intro to computer science class. You walk in and your professor lets everyone know there will be a simple 10 question quiz. This quiz is mainly for assessing where everyone is starting from and will not impact your grade, he says. You get going and the quiz is super easy but one question really stumps you. \"What is 2AF in decimal?\"",
        "choices": [
            {
                "id": "incorrect-1",
                "text": "1000",
                "effects": { "gpa": -0.1, "sanity": -3, "burnout": 0 },
                "next": "day3-after-lunch-b-incorrect"
            },
            {
                "id": "incorrect-2",
                "text": "680",
                "effects": { "gpa": -0.1, "sanity": -3, "burnout": 0 },
                "next": "day3-after-lunch-b-incorrect"
            },
            {
                "id": "correct",
                "text": "687",
                "effects": { "gpa": 0.1, "sanity": 0, "burnout": 0 },
                "next": "day3-after-lunch-b-correct"
            }
        ]
    },
    "day3-after-lunch-b-incorrect": {
        "description": "You finish the quiz and see a 9/10, while not a bad score you feel bummed out. Once everyone wraps up the professor goes over the quiz and shows the analytics of which questions were missed most, it seems like there were only a few, but thankfully for you the one you missed was a common one. The rest of class is pretty easy with most of it being spent covering the topics missed in the quiz. After class you head home to catch some sleep as after today you feel beat.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -3, "burnout": 0 },
                "next": "day4-morning-b"
            }
        ]
    },
    "day3-after-lunch-b-correct": {
        "description": "You finish the test and are glad to see that you got a 10/10. The professor goes over the quiz and shows the analytics of which questions were missed most, it seems like there were only a few. The rest of class is pretty easy with most of it being spent covering the topics missed in the quiz. After class you head home to catch some sleep as after today you feel beat.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-morning-b"
            }
        ]
    },
    "day3-morning-c": {
        "description": "You wake up with the sun shining brightly in your eyes through the curtain. You hear your roommate on the phone talking about the party last night, you imagine the noise and crowds you likely avoided and while a bit bummed feel like you made the right choice. You grab a quick breakfast alone and head to school. Classes go smoothly. You focus on the lectures, making detailed notes. When lunch comes around you head to a study room seeking a quiet place to focus on your project. You find one and take a seat and open up your laptop.",
        "choices": [
            {
                "id": "research",
                "text": "You start researching advanced concepts to introduce in the project",
                "effects": { "gpa": 0, "sanity": -10, "burnout": 5 },
                "next": "day3-after-lunch-c"
            },
            {
                "id": "coding",
                "text": "You begin coding the skeleton for the project.",
                "effects": { "gpa": 0, "sanity": -10, "burnout": 5 },
                "next": "day3-after-lunch-c"
            },
            {
                "id": "gaming",
                "text": "You see a discord message from your high school buddies back home and hop on a game with them.",
                "effects": { "gpa": -0.3, "sanity": 3, "burnout": 0 },
                "next": "day3-after-lunch-c"
            }
        ]
    },
    "day3-after-lunch-c": {
        "description": "After a productive lunch, it’s time for your next class, intro to computer science. Your professor announces a simple 10-question quiz, \"mainly for assessing where everyone is starting from and will not impact your grade.\" You get going, and the quiz is straightforward, but one question in particular gives you a small bit of trouble. \"What is 2AF in decimal?\"",
        "choices": [
            {
                "id": "incorrect-1",
                "text": "1000",
                "effects": { "gpa": -0.1, "sanity": -5, "burnout": 0 },
                "next": "day3-after-lunch-c-incorrect"
            },
            {
                "id": "incorrect-2",
                "text": "680",
                "effects": { "gpa": -0.1, "sanity": -5, "burnout": 0 },
                "next": "day3-after-lunch-c-incorrect"
            },
            {
                "id": "correct",
                "text": "687",
                "effects": { "gpa": 0.1, "sanity": 0, "burnout": 0 },
                "next": "day3-after-lunch-c-correct"
            }
        ]
    },
    "day3-after-lunch-c-incorrect": {
        "description": "You finish the quiz and see a 9/10 while not a bad score, you feel bummed out. Once everyone wraps up the professor goes over the quiz and shows the analytics of which questions were missed most. It seems like there were only a few, but thankfully for you the one you missed was a common one. The rest of class is pretty easy with most of it being spent covering the topics missed in the quiz. After class, you head home to catch some sleep as after today you feel beat.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -2, "burnout": 0 },
                "next": "day4-morning-c"
            }
        ]
    },
    "day3-after-lunch-c-correct": {
        "description": "You finish the test and are glad to see that you got a 10/10. The professor goes over the quiz and shows the analytics of which questions were missed most; it seems like there were only a few. The rest of class is pretty easy with most of it being spent covering the topics missed in the quiz. After class, you head home to catch some sleep as after today you feel beat.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 2, "burnout": 0 },
                "next": "day4-morning-c"
            }
        ]
    },
    "day4-morning-a": {
        "description": "Like every other day today starts with you waking up brushing your teeth and getting into your outfit and heading to school but when you get outside you realize it’s raining so you head to the bus stop. While waiting for the bus Jerome walks up and waits there with you, when the bus arrives you both get on and head to school. Once you get to the school your clothes are all wet and you just feel gross. You see Rachel and Michael sitting the common completely dry, you recall they did tell you they live in the tower and honestly feel a bit envious. You walk up to them and start talking with them. You guys have about 20 minutes before class and decide to play some ping pong. The 20 minutes go pretty quick but you kinda wanted to play some more.",
        "choices": [
            {
                "id": "ping-pong",
                "text": "You decide to play some more ping pong even if it results in you missing some class lecture",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-morning-a-decision1"
            },
            {
                "id": "class",
                "text": "You put the equipment away and head to class.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-morning-a-decision2"
            }
        ]
    },
    "day4-morning-a-decision1": {
        "description": "You end up rallying for another 15 minutes and head to class in a rush you walk in and realize there was a pop quiz that you just missed. You feel a bit dumb for missing it but oh well what can you do.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": -0.7, "sanity": -10, "burnout": 0 },
                "next": "day4-lunch-a"
            }
        ]
    },
    "day4-morning-a-decision2": {
        "description": "You get to class your professor lets you all know there will be a pop quiz, although it will be graded it should be very easy. You finish the quiz in about 7 minutes and feel glad the quiz really was super easy.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 3, "burnout": 0 },
                "next": "day4-lunch-a"
            }
        ]
    },
    "day4-lunch-a": {
        "description": "The rest of class goes by smoothly as you start to dive deeper into the importance of OOP. It all seems pretty simple and you start to feel better as you are basically dry now. After class you have lunch again but this time you have some food from home so you sit in the commons while Rachel Micheal and Josh go and grab some food. You take out your laptop to kill the time as you wait. You start looking for things to do.",
        "choices": [
            {
                "id": "study",
                "text": "You watch some videos on OOP to try and get ahead.",
                "effects": { "gpa": 0, "sanity": -10, "burnout": 5 },
                "next": "day4-commons-a"
            },
            {
                "id": "work",
                "text": "You work on the project due Friday.",
                "effects": { "gpa": 0, "sanity": -10, "burnout": 5 },
                "next": "day4-commons-a"
            },
            {
                "id": "game",
                "text": "You play some video games.",
                "effects": { "gpa": -0.3, "sanity": 3, "burnout": 0 },
                "next": "day4-commons-a"
            }
        ]
    },
    "day4-commons-a": {
        "description": "While doing so you get very into it and don’t even notice your friends came back until Rachel taps your shoulder asking if you wanted her fries which you accept. You guys finish eating and decide to work on the homework from yesterday together. Josh being the genuine he is already finished them all but offers to help if anyone has questions. You guys finish up the homework for yesterday and today in a short hour thanks to everyone's help and have enough time to mess around with the activities in the commons.",
        "choices": [
            {
                "id": "pool",
                "text": "You go play pool with Rachel.",
                "effects": { "gpa": 0, "sanity": 2, "burnout": 0 },
                "next": "day4-after-commons-a"
            },
            {
                "id": "ping-pong",
                "text": "You go play ping pong with Josh.",
                "effects": { "gpa": 0, "sanity": 2, "burnout": 0 },
                "next": "day4-after-commons-a"
            },
            {
                "id": "foosball",
                "text": "You go play Foosball with Michael.",
                "effects": { "gpa": 0, "sanity": 2, "burnout": 0 },
                "next": "day4-after-commons-a"
            }
        ]
    },
    "day4-after-commons-a": {
        "description": "After some pretty intense games time for class rolls around and you guys pack up and head out. The rest of the day goes by quickly and you guys decide to go out and eat once all the classes are done. You guys decided on going to The Cheesecake Factory because Josh has never been and the rest of you were adamant that he had to try it. After your 10/10 dinner you head home to get some sleep excited for Friday to start so you can get on with your weekend.",
        "choices": [
            {
                "id": "sleep",
                "text": "Go to bed right away",
                "effects": { "gpa": 0, "sanity": 2, "burnout": -2 },
                "next": "day5-morning-a"
            },
            {
                "id": "sleep-late",
                "text": "Go to bed Late",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "insanity-start"
            }
        ]
    },
    "day4-morning-b": {
        "description": "Like every other day today starts with you waking up brushing your teeth and getting into your outfit and heading to school but when you get outside you realize it’s raining so you head to the bus stop. While waiting for the bus Jerome walks up and waits there with you while you both chat away, when the bus arrives you both get on and head to school. Once you get to the school your clothes are all wet and you just feel gross. You both see Sarha sitting the common completely dry, you recall they did tell you they live in the tower and honestly feel a bit envious. You walk up to her and start talking with her. You guys have about 20 minutes before class and decide to play some ping pong. The 20 minutes go pretty quick but you kinda wanted to play some more.",
        "choices": [
            {
                "id": "ping-pong",
                "text": "You decide to play some more ping pong even if it results in you missing some class lecture",
                "effects": { "gpa": -0.2, "sanity": 2, "burnout": 0 },
                "next": "day4-morning-b-decision1"
            },
            {
                "id": "class",
                "text": "You put the equipment away and head to class.",
                "effects": { "gpa": 0.2, "sanity": -10, "burnout": 3 },
                "next": "day4-morning-b-decision2"
            }
        ]
    },
    "day4-morning-b-decision1": {
        "description": "You end up rallying for another 15 minutes and head to class in a rush you walk in and realize there was a pop quiz that you just missed. You feel a bit dumb for missing it but oh well what can you do.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-lunch-b"
            }
        ]
    },
    "day4-morning-b-decision2": {
        "description": "You get to class your professor lets you all know there will be a pop quiz, although it will be graded it should be very easy. You finish the quiz in about 7 minutes and feel glad the quiz really was super easy.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-lunch-b"
            }
        ]
    },
    "day4-lunch-b": {
        "description": "The rest of class goes by smoothly as you start to dive deeper into the importance of OOP. It all seems pretty simple and you start to feel better as you are basically dry now. After class you have lunch again but this time you have some food from home so you sit in the commons while Rachel Micheal and Josh go and grab some food. You take out your laptop to kill the time as you wait. You start looking for things to do.",
        "choices": [
            {
                "id": "study",
                "text": "You watch some videos on OOP to try and get ahead.",
                "effects": { "gpa": 0, "sanity": -10, "burnout": 3 },
                "next": "day4-commons-b"
            },
            {
                "id": "work",
                "text": "You work on the project due Friday.",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 3 },
                "next": "day4-commons-b"
            },
            {
                "id": "game",
                "text": "You play some video games.",
                "effects": { "gpa": -0.2, "sanity": 2, "burnout": -2 },
                "next": "day4-commons-b"
            }
        ]
    },
    "day4-commons-b": {
        "description": "You get really into it and don’t realize Sarah and Jerome are back until Jerome taps you on the shoulder. You guys eat your food and decide to work on the project now that you are all there. You guys spend the rest of the day doing so which is definitely needed as none of you are experts in the subject. After a few hours of this you are all exhausted and head home to catch some much needed sleep.",
        "choices": [
            {
                "id": "sleep",
                "text": "Go to bed right away",
                "effects": { "gpa": 0, "sanity": 2, "burnout": 0 },
                "next": "day5-morning-b"
            },
            {
                "id": "sleep-late",
                "text": "Go to bed Late",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "insanity-start"
            }
        ]
    },
    "day4-morning-c": {
        "description": "Like every other day you start off by waking up and going to brush your teeth, then you get dressed and head out to school. When you get outside you realize that it’s raining so you head to the bus stop. When you get there you see Jerome is already there waiting for the bus. You stand a far bit away and silently wait for the bus. You finally get to school and you are soaked. You head to class although a bit early and take a seat by the window so you can watch the rain. You have about 20 minutes to kill before class starts.",
        "choices": [
            {
                "id": "study",
                "text": "You decide to go over some of your notes so that you are well prepared for class here in a bit.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-morning-c-decision1"
            },
            {
                "id": "work",
                "text": "You decide to do some more work on your project.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-morning-c-decision2"
            },
            {
                "id": "music",
                "text": "You decide to listen to some music and relax in your spare time.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-morning-c-decision3"
            }
        ]
    },
    "day4-morning-c-decision1": {
        "description": "You immerse yourself in your notes gearing up for the lecture. The time flies by, and you feel well-prepared when class begins. Your professor lets you all know there will be a pop quiz; although it will be graded, it should be very easy. You finish the quiz in about 7 minutes and feel glad the quiz really was super easy.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day4-lunch-c"
            }
        ]
    },
    "day4-morning-c-decision2": {
        "description": "You find your project and make sure your tabs are all prepped for work. While your clothes are still damp, your focus is on your project. You make significant progress in a short time. The Professor arrives at class and announces a pop quiz. You manage to finish it, but some questions feel rushed.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day4-lunch-c"
            }
        ]
    },
    "day4-morning-c-decision3": {
        "description": "You put in your headphones and listen to some music. You get the sudden urge to walk around so you get up and take a stroll through the halls making sure to avoid any unnecessary interaction with the people around. You end up getting to class late and you missed a pop quiz the professor gave at the start of class. You feel a bit dumb for missing it, but oh well what can you do.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day4-lunch-c"
            }
        ]
    },
    "day4-lunch-c": {
        "description": "The rest of class goes by smoothly as you start to dive deeper into the importance of OOP. It all seems pretty simple, and you start to feel better as you are basically dry now. After class, you have lunch again, but this time you have some food from home, so you find a quiet table in the Commons. You pull out your laptop, ignoring the general public.",
        "choices": [
            {
                "id": "study",
                "text": "You watch some videos on advanced OOP concepts to get ahead.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-end-of-day-c"
            },
            {
                "id": "work",
                "text": "You work on your solo project due Friday, making significant progress.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day4-end-of-day-c"
            },
            {
                "id": "game",
                "text": "You play some intricate single-player video games on your laptop.",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "day4-end-of-day-c"
            }
        ]
    },
    "day4-end-of-day-c": {
        "description": "You get really into it, barely noticing the Commons filling and emptying. You finish eating and decide to do some more work on your project independently. You spend the rest of the day focused in your work, fueled by a sense of personal accomplishment. After a few hours of intense concentration, you are exhausted and head home to catch some much-needed sleep.",
        "choices": [
            {
                "id": "sleep",
                "text": "Go to bed right away",
                "effects": { "gpa": 0, "sanity": 5, "burnout": 0 },
                "next": "day5-morning-c"
            },
            {
                "id": "sleep-late",
                "text": "Go to bed Late",
                "effects": { "gpa": 0, "sanity": -5, "burnout": 0 },
                "next": "insanity-start"
            }
        ]
    },
    "day5-morning-a": {
        "description": "It’s Friday morning, and you wake up feeling refreshed and ready for the day. You’re excited that it's the end of the first week of college, and you have plans for the weekend. After you get ready, you have a choice. What will you do?",
        "choices": [
            {
                "id": "meet-up",
                "text": "Text Michael and Rachel to meet up and walk to class together.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-a-decision1"
            },
            {
                "id": "walk-alone",
                "text": "Walk to class alone, listening to music or a podcast.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-a-decision2"
            },
            {
                "id": "commons",
                "text": "Go to the Commons to grab breakfast before class.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-a-decision3"
            }
        ]
    },
    "day5-morning-a-decision1": {
        "description": "You meet up with Michael and Rachel, and the three of you walk to class together. You talk about your plans for the weekend and how you feel about the first week. You feel closer as friends, and you feel ready to take on the day.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-a"
            }
        ]
    },
    "day5-morning-a-decision2": {
        "description": "You walk to class alone listening to music. You feel calm and collected and you are ready to take on the day. You see a few people you know, but you just wave and keep walking. You feel good about your decision.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-a"
            }
        ]
    },
    "day5-morning-a-decision3": {
        "description": "You head to the Commons to grab breakfast before class. You see a few people you know, but you just grab your food and find a quiet table to eat. You feel a bit lonely and wrap up your meal and head to class.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-a"
            }
        ]
    },
    "day5-class-a": {
        "description": "You walk into your Intro to CS class, and remember it's time for the Freshman Project Showcase. This is a chance for groups (or individuals) to briefly present a simple program they developed or a concept they mastered. Your group is up next, and the air is buzzing with nervous energy and excitement. Your group is about to present. How will you approach this final display of your first week's efforts?",
        "choices": [
            {
                "id": "volunteer",
                "text": "Volunteer to present the technical details.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-a-decision1"
            },
            {
                "id": "rachel-present",
                "text": "Suggest Rachel presents the user experience (UX) and overall vision.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-a-decision2"
            },
            {
                "id": "josh-present",
                "text": "Propose Josh handles the main presentation.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-a-decision3"
            }
        ]
    },
    "day5-class-a-decision1": {
        "description": "You step forward as your group's designated presenter for the technical aspects. You explain the code clearly, but a few technical questions from the professor leave you slightly stumped, causing you to hesitate. You manage to answer, but it's not a flawless performance. You get a decent score, but it’s clear you have more to learn.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-a"
            }
        ]
    },
    "day5-class-a-decision2": {
        "description": "Rachel steps up to present the user experience and the project's overall vision, while you and the others stand ready to support.  Rachel begins with enthusiasm, but under the professor's direct questions, she gets a bit flustered, occasionally glancing at you or Michael for help. The presentation is adequate, but it struggles to fully convey the project's potential.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-a"
            }
        ]
    },
    "day5-class-a-decision3": {
        "description": "Josh, with his usual quiet confidence, takes the lead on the presentation. Josh delivers a concise, brilliant presentation that thoroughly impresses the professor and classmates. His articulate explanations and deep understanding make your group's project shine, demonstrating your smart decision to delegate to the team's strongest asset. Your group receives high grades.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-a"
            }
        ]
    },
    "day5-celebrate-a": {
        "description": "The project showcase is over. Your group is proud of what you've accomplished. You feel a sense of relief and accomplishment. You have a free afternoon, and your friends are asking what you want to do. With the stress of the showcase behind you, your group is ready to celebrate. What will you do?",
        "choices": [
            {
                "id": "commons",
                "text": "Head to the Commons for some games and to hang out.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-a-decision1"
            },
            {
                "id": "food-court",
                "text": "Go out for a celebratory lunch at the mall food court.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-a-decision2"
            },
            {
                "id": "dorm",
                "text": "Go back to your dorm to just relax. ",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-a-decision3"
            }
        ]
    },
    "day5-celebrate-a-decision1": {
        "description": "You all head to the Commons for some games and to hang out. You all play a few games of ping-pong and pool. You all feel closer as friends, and you now have a solid support group on campus.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-a"
            }
        ]
    },
    "day5-celebrate-a-decision2": {
        "description": "You all head to the campus food court for a celebratory lunch. You all talk about the project, the classes, and the memories you've made. You all feel closer as friends, and you now have a solid support group on campus.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-a"
            }
        ]
    },
    "day5-celebrate-a-decision3": {
        "description": "You all head back to your dorm to just relax. You all talk about the project, the classes, and the memories you've made. You all feel closer as friends, and you now have a solid support group on campus.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-a"
            }
        ]
    },
    "day5-morning-b": {
        "description": "It’s Friday morning, and you wake up feeling refreshed and ready for the day. You’re excited that it's the end of the first week of college, and you have plans for the weekend. After you get ready, you have a choice. What will you do?",
        "choices": [
            {
                "id": "meet-up",
                "text": " Ask Jerome if he’d want to walk to class with you.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-b-decision1"
            },
            {
                "id": "walk-alone",
                "text": "Walk to class alone, listening to music or a podcast.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-b-decision2"
            },
            {
                "id": "commons",
                "text": "Go to the Commons to grab breakfast before class.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-b-decision3"
            }
        ]
    },
    "day5-morning-b-decision1": {
        "description": "You and Jerome both walk to class together. You talk about your plans for the weekend and how you feel about the first week. You're glad you have a roommate who is chill and that you can see as a friend.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-b"
            }
        ]
    },
    "day5-morning-b-decision2": {
        "description": "You walk to class alone listening to music. You feel calm and collected and you are ready to take on the day. You see a few people you know, but you just wave and keep walking. You feel good about your decision.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-b"
            }
        ]
    },
    "day5-morning-b-decision3": {
        "description": "You head to the Commons to grab breakfast before class. You see a few people you know, but you just grab your food and find a quiet table to eat. You feel a bit lonely and wrap up your meal and head to class.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-b"
            }
        ]
    },
     "day5-class-b": {
        "description": "You walk into your Intro to CS class, and remember it's time for the Freshman Project Showcase. This is a chance for groups (or individuals) to briefly present a simple program they developed or a concept they mastered. Your group is up next, and the air is buzzing with nervous energy and excitement. Your group is about to present. How will you approach this final display of your first week's efforts?",
        "choices": [
            {
                "id": "technical",
                "text": "You decide you want to focus on the code and technical part of the projects.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-b-decision1"
            },
            {
                "id": "ui",
                "text": "SYou want to highlight the UI and creative process of the project.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-b-decision2"
            },
            {
                "id": "collaborative",
                "text": "You want to dive into the collaborative process and how your team worked together.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-b-decision3"
            }
        ]
    },
    "day5-class-b-decision1": {
        "description": "You step forward as your group's designated presenter for the technical aspects. You explain the code clearly, but a few technical questions from the professor leave you slightly stumped, causing you to hesitate. You manage to answer, but it's not a flawless performance. You get a decent score, but it’s clear you have more to learn.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-b"
            }
        ]
    },
    "day5-class-b-decision2": {
        "description": "Sarah (whose design sense is apparent) takes the initiative to showcase the unique design elements and user interface of your project. Sarah absolutely kills, delivering a captivating presentation of the project's creative vision. Her punk-rock flair adds a unique touch that visibly impresses the professor and classmates. Your group receives an A for its innovative and visually appealing work.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-b"
            }
        ]
    },
    "day5-class-b-decision3": {
        "description": "You or Jerome will cover how your small team worked together, outlining your challenges and successes. You and Jerome describe the team's process, but the narrative feels a bit flat failing to fully convey the dynamic interactions and specific challenges overcome. The professor notes the project's completion but doesn't see exceptional teamwork.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-b"
            }
        ]
    },
    "day5-celebrate-b": {
        "description": "The project showcase is over. Your group is proud of what you've accomplished. You feel a sense of relief and accomplishment. You have a free afternoon, and your friends are asking what you want to do. With the stress of the showcase behind you, your group is ready to celebrate. What will you do?",
        "choices": [
            {
                "id": "movie",
                "text": "Suggest a chill movie night at someone's dorm.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-b-decision1"
            },
            {
                "id": "game",
                "text": "Head to the campus game room for some competitive fun.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-b-decision2"
            },
            {
                "id": "pizza",
                "text": "Go out for a casual dinner at a nearby pizza place.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-b-decision3"
            }
        ]
    },
    "day5-celebrate-b-decision1": {
        "description": "You all head to a dorm for a relaxed movie night. You settle in with snacks, chatting and laughing between scenes. It's a low-key, comfortable way to unwind, solidifying your bonds in a relaxed setting. You feel a sense of contentment, appreciating the calm and genuine connection.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-b"
            }
        ]
    },
    "day5-celebrate-b-decision2": {
        "description": "You all head to the campus game room. You spend the afternoon playing arcade games, pool, and challenging each other in various competitive activities. The playful rivalry brings you all closer, celebrating your success with energetic fun. You feel a sense of satisfaction from both the project and the shared good times.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-b"
            }
        ]
    },
    "day5-celebrate-b-decision3": {
        "description": "You all go to a nearby pizza place for a casual dinner. Over slices of pizza and soda, you recap the week, sharing funny stories and early college experiences. The simple meal and good company feel like a well-deserved reward, fostering a warm, easygoing friendship. You feel grateful for the new connections and the simple joy of shared moments.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-b"
            }
        ]
    },
    "day5-morning-c": {
        "description": "It’s Friday morning, and you wake up feeling the weight of the week, but also a fierce determination. You’re excited that it's the end of the first week of college, and you have plans for the weekend – plans that involve a much-needed mental break. After you get ready, you have a choice. What will you do?",
        "choices": [
            {
                "id": "walk-alone",
                "text": "Walk to class alone, reviewing your project in your head.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-c-decision1"
            },
            {
                "id": "walk-alone-music",
                "text": "Walk to class alone, listening to music or a podcast to clear your head.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-c-decision2"
            },
            {
                "id": "commons",
                "text": "Go to the Commons to grab breakfast before class.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-morning-c-decision3"
            }
        ]
    },
    "day5-morning-c-decision1": {
        "description": "You walk to class alone, mentally rehearsing your presentation, going over the code in your head. You feel a deep understanding of your work, a sense of quiet mastery.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-c"
            }
        ]
    },
    "day5-morning-c-decision2": {
        "description": "You walk to class alone, letting the music wash over you, a much-needed escape from the week's intensity. You feel calm and collected, ready to face the day on your own terms.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-c"
            }
        ]
    },
    "day5-morning-c-decision3": {
        "description": "You head to the Commons to grab breakfast before class, keeping your gaze down, wanting to be unnoticed. You grab your food and find a quiet table to eat, feeling a bit isolated as other students chat around you.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-c"
            }
        ]
    },
    "day5-class-c": {
        "description": "You walk into your Intro to CS class, and realize you are the only one doing a solo project. This gets you nervous and thinking if you’ve done enough prep for this.",
        "choices": [
            {
                "id": "technical",
                "text": "You decide to to focus on the technical parts of the project in hopes to highlight the complex features you included.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-c-decision1"
            },
            {
                "id": "unique",
                "text": "You decide to present the problem you chose to tackle with the project and the unique way you did so.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-c-decision2"
            },
            {
                "id": "solo-journey",
                "text": "You decide to present the journey this assignment took you on mainly focusing on the fact that you are a solo group.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-class-c-decision3"
            }
        ]
    },
    "day5-class-c-decision1": {
        "description": "You deliver a brilliant, in-depth explanation of your solo project's technical intricacies. You confidently tackle complex questions and impress the professor and your classmates with your deep understanding, securing a great grade.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-c"
            }
        ]
    },
    "day5-class-c-decision2": {
        "description": "You present your innovative concept with excitement, but you struggle to articulate some of the more abstract ideas clearly, leading to some confusion. The core idea is good, but the presentation doesn't fully capture its potential.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-c"
            }
        ]
    },
    "day5-class-c-decision3": {
        "description": "You speak proudly about your journey, but your voice is soft, and you occasionally lose your train of thought, making it difficult for the class to fully connect with your experience. The professor appreciates the effort but notes a lack of organization.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "day5-celebrate-c"
            }
        ]
    },
    "day5-celebrate-c": {
        "description": "The project showcase is over. You've completed your first major solo endeavor. You feel a profound sense of relief and individual accomplishment. You have a free afternoon, a blank slate stretching before you. With the stress of the showcase behind you, you feel ready to celebrate. What will you do?",
        "choices": [
            {
                "id": "study",
                "text": "You head to a study room to study in silence. ",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-c1"
            },
            {
                "id": "game",
                "text": "You head to your dorm to play video games and relax.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-c2"
            },
            {
                "id": "explore",
                "text": "You talk a walk around Neumont and Neumont south to find places you haven’t seen before.",
                "effects": { "gpa": 0, "sanity": 0, "burnout": 0 },
                "next": "end-c3"
            }
        ]
    },
    "end-a": {
        "description": "You feel like you have found your place and have a great group of friends. You are happy that you decided to go to the gathering in the Commons and meet Michael and Rachel. You are glad that you decided to go to Cody's party and get to know more people. You feel like you have a great group of friends who will always be there for you, and you are excited for what the future holds for you and your positive support group.",
        "choices": [
        ]
    },
    "end-b": {
        "description": "You reflect on your first week of college. Choosing to sit on the couches led you to Sarah and Jerome, and together, you navigated the initial challenges of campus life. Your academic progress feels solid, a result of diligent effort, and you've found a small, yet reliable, team for support. While you haven't sought out the spotlight, you've cultivated a sense of quiet competence and formed meaningful connections with those who share your interests. You feel prepared for the challenges ahead, knowing you have a focused path and a small, trusted circle to share it with, ready to tackle future projects with your unique blend of skills.",
        "choices": [
        ]
    },
    "end-c1": {
        "description": "You head into the study room and are glad to see it empty. You take out your laptop and find a free online course for inheritance and decide to dive into that, as you recall the professor saying that would be covered later on. You really enjoy the topics covered and see just how powerful OOP can be. Satisfied with your study session you head home to get some sleep and prep for the weekend.",
        "choices": [
        ]
    },
    "end-c2": {
        "description": "You get into your room and immediately fire up your favorite game. The hours fly away as you immerse yourself in virtual worlds, a welcome escape from school. The week's challenges were tough, but the feeling of conquering them on your own terms has earned you this moment of pure uninterrupted comfort.",
        "choices": [
        ]
    },
    "end-c3": {
        "description": "You embark on a long walk around campus, discovering hidden paths and quiet spots you hadn't noticed before. The fresh air and gentle exercise clear your head, and you enjoy the simple act of independent exploration. You feel a quiet confidence growing, knowing you can find your way, both on campus and in your new life without needing a crowd.",
        "choices": [
        ]
    },
    "insanity-start": {
        "description": "You wake up and it’s a bright Friday morning, but you are not having it. You feel exhausted and everything around you is irritating from the sound of the light flickering to the sound of your roommate walking outside. Though your body is aching you get up and get ready for your presentation. You decide to skip breakfast and immediately start walking to school once you get ready. You get to that school and the sound from the commons is overarching. While walking through a student absorbed in their phone bumps into you. The student looks at you in a way that just doesn’t sit right with you. In that spilt moment",
        "choices": [
            {
                "id": "push",
                "text": "You decide to shove the student back.",
                "effects": { "gpa": 0, "sanity": -20, "burnout": 0 },
                "next": "insanity-decision1"
            },
            {
                "id": "get-off-phone",
                "text": "You tell the student to watch out and get off their phone.",
                "effects": { "gpa": 0, "sanity": -20, "burnout": 0 },
                "next": "insanity-decision2"
            }
        ]
    },
    "insanity-decision1": {
        "description": "The student screams at you asking what's your problem.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -20, "burnout": 0 },
                "next": "insanity-end-part-1"
            }
        ]
    },
    "insanity-decision2": {
        "description": "The student tells you that it was an accident and that you better calm down. This throws you over the edge.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -15, "burnout": 0 },
                "next": "insanity-end-part-1"
            }
        ]
    },
    "insanity-end-part-1": {
        "description": "At this point your hands are up and you are walking towards the student. What commenced afterwards can only be summarized as a sad excuse of a fight. You take a swig at the student and completely miss, the student then takes you down to the ground and you both roll around for a good minute before the other students walk in and break up the fight. The admins are all around you guys making sure nobody leaves. A few short minutes after a police officer walks in and questions both of you.",
        "choices": [
            {
                "id": "next",
                "text": "Next",
                "effects": { "gpa": 0, "sanity": -15, "burnout": 0 },
                "next": "insanity-end-part-2"
            }
        ]
    },
    "insanity-end-part-2": {
        "description": "The stress really got you this week and led to you making an irrational decision ultimately leading to a night behind bars and being expelled from the school. You take this as a learning moment and reflect on how you could have avoided this outcome.",
        "choices": [
        ]
    }
}
